#+TITLE: BSU
#+AUTHOR: Justin Johnson

***** Notes
	  *I accidently deleted stuff...missing notes and files*
#+NAME: Function Pointers
#+HEADER: :dir ./src/c
#+HEADER: :file functionPointers.txt
#+HEADER: :tangle ./src/c/functionPointers.c
#+BEGIN_SRC C :includes '(<stdio.h> <stdlib.h>)
printf("Hello World");
#+END_SRC

#+RESULTS: Function Pointers
: DEBUG: Entering a string/function foo!

